stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_flash_ex.c
  return status;
}

/**
  * @brief  Return the extended secure hide area.
  *
  * @param  pHDPExtension [in/out] pointer to an @ref FLASH_HDPExtensionTypeDef structure
  *         that contains the configuration information.
  *
  * @note   The field pHDPExtension->Bank should indicate which area is requested
  *         for the extended secure hide area.
  *
  * @retval  None
  */
void HAL_FLASHEx_GetConfigHDPExtension(FLASH_HDPExtensionTypeDef *pHDPExtension)
{
  /* Check the parameters */
  assert_param(IS_FLASH_BANK_EXCLUSIVE(pHDPExtension->Bank));

  if ((pHDPExtension->Bank) == FLASH_BANK_1)
  {
    pHDPExtension->NbPages = (FLASH->SECHDPEXTR & FLASH_SECHDPEXTR_HDP1_EXT);
  }
  else
  {
    pHDPExtension->NbPages = ((FLASH->SECHDPEXTR & FLASH_SECHDPEXTR_HDP2_EXT) >> FLASH_SECHDPEXTR_HDP2_EXT_Pos);
  }
}

/**
  * @brief  Activation of the protection of the extended secure hide area.
  *
  * @param  Banks indicate the bank concerned by the activation
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_BANK_1 Bank1 to be protected
  *            @arg @ref FLASH_BANK_2 Bank2 to be protected
  *            @arg @ref FLASH_BANK_BOTH Bank1 and Bank2 to be protected
  * @param  ProtectionType indicate the type of protection to be performed
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_EXTHDP_ONLY_ACCESS_PROTECTED Access to area denied and bits configuration allowed
  *            @arg @ref FLASH_EXTHDP_ALL_PROTECTED Access to bits configuration and area denied
  *
  * @retval  None
  */
void HAL_FLASHEx_EnableHDPExtensionProtection(uint32_t Banks, uint32_t ProtectionType)
{
  /* Check the parameters */
  assert_param(IS_FLASH_BANK(Banks));
  assert_param(IS_FLASH_EXTHDP_PROTECTION(ProtectionType));

  if ((Banks & FLASH_BANK_1) != 0U)
  {
    MODIFY_REG(FLASH->SECHDPCR,
               FLASH_SECHDPCR_HDP1EXT_ACCDIS,
               ((ProtectionType & 0xFFU) << FLASH_SECHDPCR_HDP1EXT_ACCDIS_Pos));
  }

  if ((Banks & FLASH_BANK_2) != 0U)
  {
    MODIFY_REG(FLASH->SECHDPCR,
               FLASH_SECHDPCR_HDP2EXT_ACCDIS,
               ((ProtectionType & 0xFFU) << FLASH_SECHDPCR_HDP2EXT_ACCDIS_Pos));
  }
}
#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Get the CRC value of a read protection key.
  *
  * @param  RDPKeyType Specifies the read protection key type.
  *          This parameter can be one of the following values:
  *            @arg @ref OB_RDP_KEY_OEM1 OEM1 key
  *            @arg @ref OB_RDP_KEY_OEM2 OEM2 key
  * @param  CRCKeyValue Specifies the address to return the CRC value of the key.
  *
  * @retval  None
  */
void HAL_FLASHEx_GetRDPKeyCRC(uint32_t RDPKeyType, uint32_t *CRCKeyValue)
{
  /* Check the parameters */
  assert_param(IS_OB_RDP_KEY_TYPE(RDPKeyType));

  /* Get the CRC value of OEM key */
  if (RDPKeyType == OB_RDP_KEY_OEM1)
  {
    *CRCKeyValue = (FLASH->OEMKEYSR & FLASH_OEMKEYSR_OEM1KEYCRC);
  }
  else
  {
    *CRCKeyValue = ((FLASH->OEMKEYSR & FLASH_OEMKEYSR_OEM2KEYCRC) >> FLASH_OEMKEYSR_OEM2KEYCRC_Pos);
  }
}

/**
  * @}
  */

/** @defgroup FLASHEx_Exported_Functions_Group2 Extended Peripheral Control functions
  *  @brief   Extended Peripheral Control functions
  *
@verbatim
 ===============================================================================
                      ##### Extended Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the FLASH
    memory operations.

@endverbatim
  * @{
  */

/**
  * @brief  Configuration of the privilege attribute.
  *
  * @param  PrivMode indicate privilege mode configuration
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_SPRIV_GRANTED access to secure Flash registers is granted to privileged
  *                                          or unprivileged access
  *            @arg @ref FLASH_SPRIV_DENIED access to secure Flash registers is denied to unprivileged access
  *            @arg @ref FLASH_NSPRIV_GRANTED access to non-secure Flash registers is granted to privileged
  *                                           or unprivileged access
  *            @arg @ref FLASH_NSPRIV_DENIED access to non-secure Flash registers is denied to unprivilege access
  *
  * @retval  None
  */
void HAL_FLASHEx_ConfigPrivMode(uint32_t PrivMode)
{
  /* Check the parameters */
  assert_param(IS_FLASH_CFGPRIVMODE(PrivMode));

  MODIFY_REG(FLASH->PRIVCFGR, (FLASH_PRIVCFGR_SPRIV | FLASH_PRIVCFGR_PRIV), PrivMode);
}

/**
  * @brief  Return the value of the privilege attribute.
  *
  * @retval  It indicates the privilege mode configuration.
  *          This return value can be one of the following values:
  *            @arg @ref FLASH_SPRIV_GRANTED access to secure Flash registers is granted to privileged
  *                                          or unprivileged access
  *            @arg @ref FLASH_SPRIV_DENIED access to secure Flash registers is denied to unprivileged access
  *            @arg @ref FLASH_NSPRIV_GRANTED access to non-secure Flash registers is granted to privileged
  *                                           or unprivileged access
  *            @arg @ref FLASH_NSPRIV_DENIED access to Flash registers is denied to unprivilege accessP
  */
uint32_t HAL_FLASHEx_GetPrivMode(void)
{
  return (FLASH->PRIVCFGR & (FLASH_PRIVCFGR_SPRIV | FLASH_PRIVCFGR_PRIV));
}

#if defined (CPU_IN_SECURE_STATE)
/**
  * @brief  Configuration of the security inversion.
  *
  * @param  SecInvState indicate the flash security state configuration
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_INV_DISABLE Security state of Flash is not inverted
  *            @arg @ref FLASH_INV_ENABLE Security state of Flash is inverted
  *
  * @retval  HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_ConfigSecInversion(uint32_t SecInvState)
{
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_FLASH_CFGSECINV(SecInvState));

  /* Process Locked */
  __HAL_LOCK(&pFlash);

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    MODIFY_REG(FLASH->SCR, FLASH_SCR_INV, SecInvState);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

