stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_flash_ex.c
  return status;
}

/**
  * @brief  Return the value of the security inversion.
  *
  * @retval  It indicates the flash security state configuration
  *           This return value can be one of the following values:
  *             @arg @ref FLASH_INV_DISABLE Security state of Flash is not inverted
  *             @arg @ref FLASH_INV_ENABLE Security state of Flash is inverted
  */
uint32_t HAL_FLASHEx_GetSecInversion(void)
{
  return (FLASH->SCR & FLASH_SCR_INV);
}
#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Enable the Power-down Mode for Flash Banks
  * @param  Banks indicate which bank to put in power-down mode
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_BANK_1 Flash Bank 1
  *            @arg @ref FLASH_BANK_2 Flash Bank 2
  *            @arg @ref FLASH_BANK_BOTH Flash Bank 1 and Bank 2
  * @retval  HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_EnablePowerDown(uint32_t Banks)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_FLASH_BANK(Banks));

  /* Request power-down mode for Bank 1 */
  if ((Banks & FLASH_BANK_1) != 0U)
  {
    /* Check PD1 and PDREQ1 bits (Flash is not in power-down mode and not being
       already under power-down request) */
    if ((FLASH->SR & FLASH_SR_PD1) != 0U)
    {
      status = HAL_ERROR;
    }
    else if ((FLASH->ACR & FLASH_ACR_PDREQ1) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Unlock PDREQ bit */
      WRITE_REG(FLASH->PDKEY1R, FLASH_PDKEY1_1);
      WRITE_REG(FLASH->PDKEY1R, FLASH_PDKEY1_2);

      /* Set PDREQ in FLASH_ACR register */
      SET_BIT(FLASH->ACR, FLASH_ACR_PDREQ1);

      /* Check PD1 bit */
      tickstart = HAL_GetTick();
      while (((FLASH->SR & FLASH_SR_PD1) == 0U))
      {
        if ((HAL_GetTick() - tickstart) > FLASH_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Request power-down mode for Bank 2 */
  if ((Banks & FLASH_BANK_2) != 0U)
  {
    /* Check PD2 and PDREQ2 bits (Bank 2 is not in power-down mode and not being
       already under power-down request) */
    if ((FLASH->SR & FLASH_SR_PD2) != 0U)
    {
      status = HAL_ERROR;
    }
    else if ((FLASH->ACR & FLASH_ACR_PDREQ2) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Unlock PDREQ2 bit */
      WRITE_REG(FLASH->PDKEY2R, FLASH_PDKEY2_1);
      WRITE_REG(FLASH->PDKEY2R, FLASH_PDKEY2_2);

      /* Set PDREQ2 in FLASH_ACR register */
      SET_BIT(FLASH->ACR, FLASH_ACR_PDREQ2);

      /* Check PD2 bit */
      tickstart = HAL_GetTick();
      while (((FLASH->SR & FLASH_SR_PD2) == 0U))
      {
        if ((HAL_GetTick() - tickstart) > FLASH_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  return status;
}

/**
  * @brief  Configuration of the Low-Power read Mode.
  *
  * @param  ConfigLPM indicate the Low-Power read Mode configuration.
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_LPM_ENABLE Flash is in low-power read mode
  *            @arg @ref FLASH_LPM_DISABLE Flash is in normal read mode
  *
  * @retval  HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_ConfigLowPowerRead(uint32_t ConfigLPM)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_FLASH_CFGLPM(ConfigLPM));

  /* Set LPM Bit in FLASH_ACR register */
  MODIFY_REG(FLASH->ACR, FLASH_ACR_LPM, ConfigLPM);

  /* Check that low power read mode has been activated */
  if (READ_BIT(FLASH->ACR, FLASH_ACR_LPM) != ConfigLPM)
  {
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Return the value of the Low-Power read Mode.
  *
  * @retval  It indicates the flash low-power read mode configuration
  *           This return value can be one of the following values:
  *             @arg @ref FLASH_LPM_ENABLE Flash is in low-power read mode
  *             @arg @ref FLASH_LPM_DISABLE Flash is in normal read mode
  */
uint32_t HAL_FLASHEx_GetLowPowerRead(void)
{
  return (FLASH->ACR & FLASH_ACR_LPM);
}

/**
  * @brief  Return the on-going Flash Operation. After a system reset, return
  *         the interrupted Flash operation, if any.
  *
  * @param  pFlashOperation [out] pointer to a @ref FLASH_OperationTypeDef structure
  *         that contains the Flash operation information.
  *
  * @retval  None
  */
void HAL_FLASHEx_GetOperation(FLASH_OperationTypeDef *pFlashOperation)
{
  uint32_t opsr_reg = FLASH->OPSR;

  /* Get Flash operation Type */
  pFlashOperation->OperationType = opsr_reg & FLASH_OPSR_CODE_OP;

  /* Get Flash operation memory */
  pFlashOperation->FlashArea = opsr_reg & FLASH_OPSR_SYSF_OP;

  /* Get Flash operation address */
  pFlashOperation->Address = opsr_reg & FLASH_OPSR_ADDR_OP;
}

/**
  * @}
  */

/** @defgroup FLASHEx_Exported_Functions_Group3 Extended ECC operation functions
  *  @brief   Extended ECC operation functions
  *
@verbatim
 ===============================================================================
                  ##### Extended ECC operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the Extended FLASH
    ECC Operations.

@endverbatim
  * @{
  */
/**
  * @brief  Enable ECC correction interrupt
  *
  * @note   ECC detection does not need to be enabled as directly linked to
  *         Non-Maskable Interrupt (NMI)
  *
  * @retval  None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_ECCC);
}

/**
  * @brief  Disable ECC correction interrupt
  *
  * @retval  None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_ECCC);
}

/**
  * @brief  Get the ECC error information.
  *
  * @param  pData Pointer to an @ref FLASH_EccInfoTypeDef structure that contains the
  *         ECC error information.
  *
  * @note   This function should be called before ECC bit is cleared
  *         (in callback function)
  *
  * @retval  None
  */
void HAL_FLASHEx_GetEccInfo(FLASH_EccInfoTypeDef *pData)
{
  uint32_t eccr;
  /* Check Null pointer */
  assert_param(pData != NULL);

  /* Get back information from ECC register */
  if ((FLASH->ECCCR & FLASH_FLAG_ECCC) != 0U)
  {
    eccr = FLASH->ECCCR;
  }
  else
  {
    eccr = FLASH->ECCDR;
  }

  /* Retrieve and sort information */
  pData->Area = (eccr & (FLASH_ECCCR_SYSF_ECC | FLASH_ECCCR_BK_ECC));
  pData->Address = ((eccr & FLASH_ECCCR_ADDR_ECC) << 3U);

  /* Add Base address depending on targeted area */
  if (pData->Area == FLASH_ECC_AREA_USER_BANK1)
  {
    pData->Address |= FLASH_BASE;
  }
  else if (pData->Area == FLASH_ECC_AREA_USER_BANK2)
  {
    pData->Address |= (FLASH_BASE + FLASH_BANK_SIZE);
  }
  else
  {
#if defined (CPU_IN_SECURE_STATE)
    pData->Address |= SYSTEM_FLASH_BASE_S;
#else /* CPU_IN_SECURE_STATE */
    pData->Address |= SYSTEM_FLASH_BASE_NS;
#endif /* CPU_IN_SECURE_STATE */
  }

  /* Set Master which initiates transaction. On U3, it's necessary CPU1 */
  pData->MasterID = FLASH_ECC_MASTER_CPU1;
}

/**
  * @brief  Handle Flash ECC Detection interrupt request.
  *
  * @note   On STM32U3, this Irq Handler should be called in Non-Maskable Interrupt (NMI)
  *         interrupt subroutine.
  *
  * @retval  None
  */
void HAL_FLASHEx_ECCD_IRQHandler(void)
{
  /* Check ECC Detection Error */
  if ((FLASH->ECCDR & FLASH_FLAG_ECCD) != 0U)
  {
    /* Call User callback */
    HAL_FLASHEx_EccDetectionCallback();

