stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_flash_ex.c
  /* Configure Secure Area */
  if ((WMSecConfig & OB_WMSEC_SECURE_AREA_CONFIG) != 0U)
  {
    MODIFY_REG(tmp_secwm1, (FLASH_SECWM1R1_SECWM1_STRT | FLASH_SECWM1R1_SECWM1_END),
               ((WMSecEndPage << FLASH_SECWM1R1_SECWM1_END_Pos) | WMSecStartPage));
  }

  /* Configure Secure Hide Area */
  if ((WMSecConfig & OB_WMSEC_HDP_AREA_CONFIG) != 0U)
  {
    MODIFY_REG(tmp_secwm2, FLASH_SECWM1R2_HDP1_END, (WMHDPEndPage << FLASH_SECWM1R2_HDP1_END_Pos));
  }

  /* Enable Secure Hide Area */
  if ((WMSecConfig & OB_WMSEC_HDP_AREA_ENABLE) != 0U)
  {
    SET_BIT(tmp_secwm2, FLASH_SECWM1R2_HDP1EN);
  }

  /* Disable Secure Hide Area */
  if ((WMSecConfig & OB_WMSEC_HDP_AREA_DISABLE) != 0U)
  {
    MODIFY_REG(tmp_secwm2, FLASH_SECWM1R2_HDP1EN, (0xB4U << FLASH_SECWM1R2_HDP1EN_Pos));
  }

  /* Write SECWM registers */
  if ((WMSecConfig & OB_WMSEC_AREA1) != 0U)
  {
    FLASH->SECWM1R1 = tmp_secwm1;
    FLASH->SECWM1R2 = tmp_secwm2;
  }
  else if ((WMSecConfig & OB_WMSEC_AREA2) != 0U)
  {
    FLASH->SECWM2R1 = tmp_secwm1;
    FLASH->SECWM2R2 = tmp_secwm2;
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief  Configure the boot lock.
  *
  * @param  BootLockConfig Specifies the activation of the BOOT_LOCK.
  *          This parameter can be one of the following values:
  *            @arg @ref OB_BOOT_LOCK_DISABLE Boot Lock mode deactivated
  *            @arg @ref OB_BOOT_LOCK_ENABLE Boot Lock mode activated
  *
  * @retval  None
  */
static void FLASH_OB_BootLockConfig(uint32_t BootLockConfig)
{
  /* Check the parameters */
  assert_param(IS_OB_BOOT_LOCK(BootLockConfig));

  /* Configure the option bytes register */
  MODIFY_REG(FLASH->SBOOT0R, FLASH_SBOOT0R_BOOT_LOCK, BootLockConfig);
}
#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Configure the boot address.
  *
  * @param  BootAddrConfig specifies the area to be configured.
  *          This parameter can be one of the following values:
  *            @arg @ref OB_BOOTADDR_NS0 Non-secure boot address 0
  *            @arg @ref OB_BOOTADDR_NS1 Non-secure boot address 1
  *            @arg @ref OB_BOOTADDR_SEC0 Secure boot address 0
  * @param  BootAddr Specifies the address used for the boot
  *          This parameter can be page number between 0 and 0xFFFFFF00
  *
  * @retval  None
  */
static void FLASH_OB_BootAddrConfig(uint32_t BootAddrConfig, uint32_t BootAddr)
{
  /* Check the parameters */
  assert_param(IS_OB_BOOTADDR_CONFIG(BootAddrConfig));

  if (BootAddrConfig == OB_BOOTADDR_NS0)
  {
    MODIFY_REG(FLASH->BOOT0R, FLASH_BOOT0R_ADD, BootAddr);
  }
  else if (BootAddrConfig == OB_BOOTADDR_NS1)
  {
    MODIFY_REG(FLASH->BOOT1R, FLASH_BOOT1R_ADD, BootAddr);
  }
#if defined (CPU_IN_SECURE_STATE)
  else if (BootAddrConfig == OB_BOOTADDR_SEC0)
  {
    MODIFY_REG(FLASH->SBOOT0R, FLASH_SBOOT0R_ADD, BootAddr);
  }
#endif /* CPU_IN_SECURE_STATE */
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }
}

/**
  * @brief  Return the FLASH Write Protection Option Bytes value.
  *
  * @param[in]  WRPArea Specifies the area to be returned.
  *              This parameter can be one of the following values:
  *                @arg @ref OB_WRPAREA_BANK1_AREAA Flash Bank 1 Area A
  *                @arg @ref OB_WRPAREA_BANK1_AREAB Flash Bank 1 Area B
  *                @arg @ref OB_WRPAREA_BANK2_AREAA Flash Bank 2 Area A
  *                @arg @ref OB_WRPAREA_BANK2_AREAB Flash Bank 2 Area B
  * @param[out]  WRPStartOffset Specifies the address where to copied the start page
  *                             of the write protected area
  * @param[out]  WRPEndOffset Specifies the address where to copied the end page of
  *                           the write protected area
  * @param[out]  WRPLock Specifies the lock status of the write protected area.
  *               The returned value can be ENABLE or DISABLE
  *
  * @retval  None
  */
static void FLASH_OB_GetWRP(uint32_t WRPArea, uint32_t *WRPStartOffset, uint32_t *WRPEndOffset,
                            FunctionalState *WRPLock)
{
  /* Get the configuration of the write protected area */
  if (WRPArea == OB_WRPAREA_BANK1_AREAA)
  {
    *WRPStartOffset = READ_BIT(FLASH->WRP1AR, FLASH_WRP1AR_STRT);
    *WRPEndOffset = (READ_BIT(FLASH->WRP1AR, FLASH_WRP1AR_END) >> FLASH_WRP1AR_END_Pos);
    *WRPLock = (READ_BIT(FLASH->WRP1AR, FLASH_WRP1AR_UNLOCK) != 0U) ? DISABLE : ENABLE;
  }
  else if (WRPArea == OB_WRPAREA_BANK1_AREAB)
  {
    *WRPStartOffset = READ_BIT(FLASH->WRP1BR, FLASH_WRP1BR_STRT);
    *WRPEndOffset = (READ_BIT(FLASH->WRP1BR, FLASH_WRP1BR_END) >> FLASH_WRP1BR_END_Pos);
    *WRPLock = (READ_BIT(FLASH->WRP1BR, FLASH_WRP1BR_UNLOCK) != 0U) ? DISABLE : ENABLE;
  }
  else if (WRPArea == OB_WRPAREA_BANK2_AREAA)
  {
    *WRPStartOffset = READ_BIT(FLASH->WRP2AR, FLASH_WRP2AR_STRT);
    *WRPEndOffset = (READ_BIT(FLASH->WRP2AR, FLASH_WRP2AR_END) >> FLASH_WRP2AR_END_Pos);
    *WRPLock = (READ_BIT(FLASH->WRP2AR, FLASH_WRP2AR_UNLOCK) != 0U) ? DISABLE : ENABLE;
  }
  else if (WRPArea == OB_WRPAREA_BANK2_AREAB)
  {
    *WRPStartOffset = READ_BIT(FLASH->WRP2BR, FLASH_WRP2BR_STRT);
    *WRPEndOffset = (READ_BIT(FLASH->WRP2BR, FLASH_WRP2BR_END) >> FLASH_WRP2BR_END_Pos);
    *WRPLock = (READ_BIT(FLASH->WRP2BR, FLASH_WRP2BR_UNLOCK) != 0U) ? DISABLE : ENABLE;
  }
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }
}

/**
  * @brief  Return the FLASH Read Protection level.
  *
  * @retval  FLASH ReadOut Protection Level
  *           This return value can be one of the following values:
  *             @arg @ref OB_RDP_LEVEL_0 No protection
  *             @arg @ref OB_RDP_LEVEL_0_5 No debug access to secure area
  *             @arg @ref OB_RDP_LEVEL_1 Read protection of the memory
  *             @arg @ref OB_RDP_LEVEL_2 Full chip protection
  */
static uint32_t FLASH_OB_GetRDP(void)
{
  uint32_t rdp_level = READ_BIT(FLASH->OPTR, FLASH_OPTR_RDP);

  if ((rdp_level != OB_RDP_LEVEL_0) && (rdp_level != OB_RDP_LEVEL_0_5) && (rdp_level != OB_RDP_LEVEL_2))
  {
    return (OB_RDP_LEVEL_1);
  }
  else
  {
    return (rdp_level);
  }
}

/**
  * @brief  Return the FLASH User Option Byte value.
  *
  * @retval  The FLASH User Option Bytes values.
  *           The return value can be a combination of @arg @ref FLASH_OB_USER_BOR_LEVEL,
  *             @arg @ref FLASH_OB_USER_BDRST_POR, @arg @ref FLASH_OB_USER_NRST_STOP,
  *             @arg @ref FLASH_OB_USER_NRST_STANDBY, @arg @ref FLASH_OB_USER_NRST_SHUTDOWN,
  *             @arg @ref FLASH_OB_USER_SRAM1_RST, @arg @ref FLASH_OB_USER_IWDG_SW,
  *             @arg @ref FLASH_OB_USER_IWDG_STOP, @arg @ref FLASH_OB_USER_IWDG_STANDBY,
  *             @arg @ref FLASH_OB_USER_WWDG_SW, @arg @ref FLASH_OB_USER_SWAP_BANK,
  *             @arg @ref FLASH_OB_USER_DUALBANK, @arg @ref FLASH_OB_USER_SRAM2_PE,
  *             @arg @ref FLASH_OB_USER_SRAM2_RST, @arg @ref FLASH_OB_USER_NSWBOOT0,
  *             @arg @ref FLASH_OB_USER_NBOOT0, @arg @ref FLASH_OB_USER_IO_VDD_HSLV,
  *             @arg @ref FLASH_OB_USER_IO_VDDIO2_HSLV and @arg @ref FLASH_OB_USER_TZEN
  */
static uint32_t FLASH_OB_GetUser(void)
{
  uint32_t user_config = READ_REG(FLASH->OPTR);
  CLEAR_BIT(user_config, FLASH_OPTR_RDP);

  return user_config;
}

#if defined (CPU_IN_SECURE_STATE)
/**
  * @brief  Return the watermarked-based secure area configuration.
  *
  * @param  WMSecConfig [in/out] Specifies the area to be returned.
  *          This parameter can be one of the following values:
  *            @arg @ref OB_WMSEC_AREA1 select Flash Secure Area 1
  *            @arg @ref OB_WMSEC_AREA2 select Flash Secure Area 2
  *          When return from the function, this parameter will be a combinaison of the following values:
  *            @arg @ref OB_WMSEC_AREA1 or @ref OB_WMSEC_AREA2 selected Flash Secure Area 1 or Area 2
  *            @arg @ref OB_WMSEC_HDP_AREA_ENABLE Secure Hide Area in Secure Area enabled
  *            @arg @ref OB_WMSEC_HDP_AREA_DISABLE Secure Hide Area in Secure Area disabled
  * @param  WMSecStartPage [out] Specifies the start page of the secure area
  * @param  WMSecEndPage [out] Specifies the end page of the secure area
  * @param  WMHDPEndPage [out] Specifies the end page of the secure hide area
  *
  * @retval  None
  */
static void FLASH_OB_GetWMSEC(uint32_t *WMSecConfig, uint32_t *WMSecStartPage, uint32_t *WMSecEndPage,
                              uint32_t *WMHDPEndPage)
{
  uint32_t tmp_secwm1 = 0U;
  uint32_t tmp_secwm2 = 0U;

  /* Check the parameters */
  assert_param(IS_OB_WMSEC_CONFIG(*WMSecConfig));
  assert_param(IS_FLASH_BANK_EXCLUSIVE((*WMSecConfig) & (FLASH_BANK_1 | FLASH_BANK_2)));

  /* Read SECWM registers */
  if (((*WMSecConfig) & OB_WMSEC_AREA1) != 0U)
  {
    tmp_secwm1 = FLASH->SECWM1R1;
    tmp_secwm2 = FLASH->SECWM1R2;
  }
  else if (((*WMSecConfig) & OB_WMSEC_AREA2) != 0U)
  {
    tmp_secwm1 = FLASH->SECWM2R1;
    tmp_secwm2 = FLASH->SECWM2R2;
  }
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }

  /* Configuration of secure area */
  *WMSecStartPage = (tmp_secwm1 & FLASH_SECWM1R1_SECWM1_STRT);
  *WMSecEndPage = ((tmp_secwm1 & FLASH_SECWM1R1_SECWM1_END) >> FLASH_SECWM1R1_SECWM1_END_Pos);

  /* Configuration of secure hide area */
  *WMHDPEndPage = ((tmp_secwm2 & FLASH_SECWM1R2_HDP1_END) >> FLASH_SECWM1R2_HDP1_END_Pos);

  if ((tmp_secwm2 & FLASH_SECWM1R2_HDP1EN) == (0xB4U << FLASH_SECWM1R2_HDP1EN_Pos))
  {
    *WMSecConfig = ((*WMSecConfig) | OB_WMSEC_HDP_AREA_DISABLE);
  }
  else
  {
    *WMSecConfig = ((*WMSecConfig) | OB_WMSEC_HDP_AREA_ENABLE);
  }
}

/**
  * @brief  Return the boot lock configuration.
  *
  * @retval  Value of Boot Lock configuration
  *           It can be one of the following values:
  *             @arg @ref OB_BOOT_LOCK_DISABLE Boot Lock mode deactivated
  *             @arg @ref OB_BOOT_LOCK_ENABLE Boot Lock mode activated
  */
static uint32_t FLASH_OB_GetBootLock(void)
{
  return (FLASH->SBOOT0R & FLASH_SBOOT0R_BOOT_LOCK);
}
#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Return the boot address.
  *
  * @param[in]  BootAddrConfig Specifies the area to be returned
  *              This parameter can be one of the following values:
  *                @arg @ref OB_BOOTADDR_NS0 Non-secure boot address 0
  *                @arg @ref OB_BOOTADDR_NS1 Non-secure boot address 1
  *                @arg @ref OB_BOOTADDR_SEC0 Secure boot address 0
  * @param[out]  BootAddr specifies the boot address value
  *
  * @retval  None
  */
static void FLASH_OB_GetBootAddr(uint32_t BootAddrConfig, uint32_t *BootAddr)
{
  if (BootAddrConfig == OB_BOOTADDR_NS0)
  {
    *BootAddr = (FLASH->BOOT0R & FLASH_BOOT0R_ADD);
  }
  else if (BootAddrConfig == OB_BOOTADDR_NS1)
  {
    *BootAddr = (FLASH->BOOT1R & FLASH_BOOT1R_ADD);
  }
#if defined (CPU_IN_SECURE_STATE)
  else if (BootAddrConfig == OB_BOOTADDR_SEC0)
  {
    *BootAddr = (FLASH->SBOOT0R & FLASH_SBOOT0R_ADD);
  }
#endif /* CPU_IN_SECURE_STATE */
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */
